{
  "id": 1,
  "name": "LiLi",
  "category": "role",
  "image": "heroes_portraits/lili.webp",
  "patchNotes": [
    {
      "id": 1,
      "title": "Talent rework",
      "general": [],
      "developerCommentary": "From the start, the developers aimed to make Li Li the perfect starter hero. They believed some heroes weren't meant to be viable, which is why they didn't significantly change her or give her a higher skill ceiling. I agree that a hero doesn't necessarily need to be viable, but I dislike the idea of not giving her the potential for a high skill ceiling. Over time, this lack of potential can make players less inclined to play Li Li and opt for other characters instead. This doesn't have to be the case. In Team Fortress 2, for example, the Soldier is a perfect starter character for those unfamiliar with the game. Despite being easy to pick up, the Soldier has one of the highest skill ceilings among the nine characters. My point is, Li Li can remain an easy character to start with, but I want to slightly increase her skill floor while significantly raising her skill ceiling.",
      "general": [
        {
          "change": "Healing Brew (Q)",
          "texts": [
            {
              "text": "Additional functionality: Li Li's Healing Brew marks healed allies with cups. After an allied hero receive 3 cups Li Li can collect the cups from that hero giving him the same effects of fast feet. (Including talent ones)"
            }
          ],
          "developerCommentary": "This changes start with the concept of increasing the Li Li skill ceiling by empowering Fast Feet as an stronger tool this leads to a complete talent reestructure as Fast Feet can't be strong as it is right now because you can give an allied hero the effects of the fast feet including your talents."
        },
        {
          "change": "Fast feet (T)",
          "texts": [
            {
              "text": "Removed the faster cooldown refresh"
            },
            {
              "text": "Now increases mana regeneration by 75%"
            },

            {
              "text": "On level 10 Increase Fast feet duration to 2 seconds."
            }
          ],
          "developerCommentary": "With how healing brew works fast feet needs to be naturally a little weaker and further customize it and with the old level 1 talents being about mana regeneration i had to change it for you naturally having it otherwise lili would become mana hungry eazier. Also all fast feet talent effects will affect the heal Li Li takes the Tea so i wanted to use it as a further customizer"
        }
      ],
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "name": "New: Refreshing feet",
              "texts": [
                {
                  "text": "Increase cooldown refresh of basic abilities by 30% while fast feet is active"
                }
              ],
              "developerCommentary": "This is probally a thing i want to add at the same it can be troublesome..currently there are few things that can increase cooldown refresh of other heroes mostly Innervate(malf) and Nano Boost(Ana) and both this skills are very high cooldown with the changes on healing brew Li Li will be able to juggle this cooldown to allied heros. Also she will be able herself to increase her own effectiviness on healing but i really like the concept for newbier players see cooldown pick cooldown so that's why i'm making the other talents more situational"
            },
            {
              "name": "Safety Sprint",
              "texts": [
                {
                  "text": "Moved from level 4"
                }
              ],
              "developerCommentary": "This one is a defense situational one..the objective here is to make a Li Li player press this active to run as it was supposed to be or to go all in and taking someone cup to buff the fast feet the person will receive"
            },
            {
              "name": "New: Fast as the feet",
              "texts": [
                {
                  "text": "Fast Feet increase Li Li and Cloud serpent attack speed by 35%"
                }
              ],
              "developerCommentary": "I don't want to give ability power to her because Ana cover this role and the basic abilities alredy give spell spower besides i think the interaction on giving spell power won't be so good for something that you could SUDDENLY receive as the fast feet bonus and for that instance i choose attack speed."
            },
            {
              "name": "Free drinks",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "With the changes mades there no more use for free drinks, level 4 is a new talent tier from healing brew but i want healing brew to be used changed"
            },
            {
              "name": "Serpent sidekick",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "With the new fast as the feet covering it's attack speed part and the new healing brew effect giving speed there's no more space for serpent sidekick"
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "name": "Two for one",
              "texts": [
                {
                  "text": "Healing brew now heals an additional target being the closest hero to Li Li"
                },
                                {
                  "text": "Moved from level 16"
                }
              ],
              "developerCommentary": "This talent is one that i want to give the best control possible of who Li Li heals"
            },
            {
              "name": "New: Spill the tea",
              "texts": [
                {
                  "text": "Healing brew now heals an area around the hero by 50%"
                }
              ],
              "developerCommentary": "This one is best suited for melee teams"
            },
            {
              "name": "New: Tea time",
              "texts": [
                {
                  "text": "Tea table(Active|Toggle): The next healing brew heals all heroes on range(18 seconds)"
                }
              ],
              "developerCommentary": "This one is an alternative version of Two for one but more focused on stacking the cups"
            },
            {
              "name": "Wind serpent",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "With how i want the level 4 to focus there's no space for Wind serpent the only thing i could re-use it's the additional cooldown refresh rate on another talent"
            },
            {
              "name": "Surging Winds",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "There's no need for surging winds on how i am building Li Li but increasing spell power by hitting surging winds is a nice idea"
            },
            {
              "name": "Safety sprint",
              "texts": [
                {
                  "text": "Moved to level 1"
                }
              ],
              "developerCommentary": "Moved for better talent customization journey"
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "name": "New: Don't stop, we need adventure!",
              "texts": [
                {
                  "text": "Cloud Serpent now cleanses roots, silence, stuns and silence on cast and expire"
                },
                {
                  "text": "Fast feet increase cloud serpent refresh rate an additional 50%"
                }
              ],
              "developerCommentary": "I bring here the new Li Li cleanse..Im some ways it's better on others it's worse but why change it to that? Because i want to make the Li Li cleanse more friendly to use..this is supposed to be an entry character but at the same time it can't be useless and this is the answer i got and besides the classic cleanse is not noob friendly."
            },
            {
              "name": "Mass Vortex",
              "texts": [
                {
                  "text": "Changed functionality: Every Time Li Li hit all Blinding Wind Targets makes her next cast hit one more target and increase Li Li spell power by 12%, not hitting all targets reset the bonus"
                },
                {
                  "text": "Increase blinding wind range by 42%"
                }
              ],
              "developerCommentary": "Now this is a thing i got the idea from the Lucio talent i changed on resetting stacks, this talent always felt kinda weak and i wanted it to be stronger but not about necessarily about the damage and on that way i could say it makes the talent fair holds the nature of having more surging winds hits and could be a good entry for higher skill ceiling talents while not being so hard."
            },
            {
              "name": "Let's go",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": "As explained on the Don't stop, we need adventure! i wanted to make a eazier version of the cleanse based on Li Li being an entry healer"
            }
          ]
        },
        {
          "name": "Level 10",
          "changes": [
            {
              "name": "",
              "texts": [
                {
                  "text": ""
                }
              ],
              "developerCommentary": ""
            }
          ]
        },
        {
          "name": "Level 13",
          "changes": [
            {
              "name": "Gale force",
              "texts": [
                {
                  "text": "Changed functionality: Li Li basic attacks againt blinded heroes increases the blind duration by 0.25 and bounces to the closest hero if the hero is also blinded the attack bounces again."
                }
              ],
              "developerCommentary": "On this talent i wanted to give a more funny interaction with Surging Winds..Initially i wanted to reduce it's cooldown by hitting blinded targets but that could become recursive by hitting blind targets you blind them..kinda off..For that instance i wanted to give a bigger meaning on blinding targets by also making it work with other blind synergies like Johanna and Cássia and making the blind stronger overall."
            }
          ]
        },
        {
          "name": "Level 16",
          "changes": [
            {
              "name": "Shake it off",
              "texts": [
                {
                  "text": "Doesn't change ability refresh rate anymore"
                },
                {
                  "text": "Passive: Fast feet increases Li Li health regeneration by 400%"
                }
              ],
              "developerCommentary": "Nerfing it would be necessary for the new healing brew not become problematic as more ability refresh rate could become too strong when you can share it with other heroes. Health regeneration bonus could combo with more survavibility which is the main talent effect BUT i really don't know how much bonus health regen would be good as you could also give it to other heroes..imagine sharing health regen with a dehaka on essence build? Character would have 2 seconds of 160 health regen."
            }
          ]
        },           
         {
              "name": "Two For One",
              "texts": [
                {
                  "text": "moved to level 4"
                }
              ],
              "developerCommentary": "With how i want to build Li Li this talent came to Level 4"
            }
          ]
        },
        {
          "name": "Level 20",
          "changes": [
            {
              "name": "New:Tea bagging",
              "texts": [
                {
                  "text": "Decrease the cups needed for Li Li to collect to 2"
                }
              ],
              "developerCommentary": "With the Shake it Off change i had to add a new talent to that tier and it's hard to add talents for a character that should be simple most of the time BUT with the new mechanic created on healing brew that's not impossible, decreasing healing brew cups needed for the bonus activation would be a game changer as you could abuse more eazier with all the talents that help Li Li stacks cups more eazily."
            },
            {
              "name": "Shake it off",
              "texts": [
                {
                  "text": "Moved to level 16"
                }
              ],
              "developerCommentary": "I don't want to empower Fast Feet too much or else healing brew new effect could become problematic so i changed it's tier so i could nerf it but still make it viable."
            }
          ]
        }
      ]
    }
  ]
}
