{
  "id": 1,
  "name": "Lt-Morales",
  "role": "Healer",
  "image": "heroes_portraits/lt-morales.webp",
  "patchNotes": [
    {
      "id": 1,
      "title": "Talent rework",
      "general": [],
      "developerCommentary": "I think Morales is Top 1 or atleast Top 3 most boring characters to be played right now by a fair part of the community and tracking this feelings i came to a conclusion on way i agree with those players..Morales doesn't feel like a hero but rather a tool to your team, you don't have agency plus your job is to be a walking bot that just presses Q to someone. The changes i want to provide are based on what i think it's the ideal healing beam character and that's TF2 Medic, i want to give Morales the same level of agency as him as well some risks.",
      "general": [
        {
          "change": "Stats",
          "texts": [
            {
              "text": "Morales have no more energy regeneration and starts with 0."
            }
          ],
          "developerCommentary": "This is due to the changes on her ultimate"
        },
        {
          "change": "Healing beam (Q)",
          "texts": [
            {
              "text": "No more energy cost"
            },
            {
              "text": "Healing reduced by 30%"
            }
          ],
          "developerCommentary": "Due to the removal of energy cost it had to be nerfed"
        },
        {
          "change": "Safeguard(W)",
          "texts": [
            {
              "text": "removed"
            }
          ],
          "developerCommentary": "Safeguard is one skill that happens to make Morales more inclined to be a healbot than anything else as it work's as an extra survavibility Morales can give to another character but at the same time it's not necessary to be will timed like an cleanse on a Medivh Force of Will..You can just spam it freely. I don't think it's healthy for Morales to have a kit so inclined on being a heal bot and that's why i am removing that skill"
        },
        {
          "change": "Medivac Dropship (W)",
          "texts": [
            {
              "text": "Morales now doesn't start on the medivac"
            },
            {
              "text": "The medivac will fly to the target location within the first hero that enters"
            },
            {
              "text": "Reduces de medivac duration on land to 3 seconds"
            },
            {
              "text": "Heroes are prevented from entering the medivac while taking damage"
            }
          ],
          "developerCommentary": "One of the few tools that happens to give Morales agency is the Medivac..A tool that can transport players between areas of the map fast but by bringing this ultimate level skill to become a basic ability some changes are due to be made for balancing and usability"
        },
        {
          "change": "New:Steroids Charge (R)",
          "texts": [
            {
              "text": "Cost 100 energy"
            },
            {
              "text": "Activate to make the current Healing Beam target have increased 50% attack speed and 10% movement speed bonus, redirecting healing beam lets the previous target within the charge for 0.5 seconds."
            },
            {
              "text": "This Ability is slowly charged over time by healing allied heros with healing beam. Morales Loses all energy if she dies"
            }
          ],
          "developerCommentary": "As said before i want to bring Morales closer to what i felt by playing Medic on TF2 and one of this changes include making the Morales Steroids a baseline Skill by charging, i feel it increases Morales feeling of 'doing something' by charging the skill playing correctly instead of just waiting cooldown and also making it the root core ability that distinguishes her from other healers."
        }
      ],
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "name": "Caduceus feedback",
              "texts": [
                {
                  "text": "Energy grant per basic attack from 4 to 1",
                  "subtexts": [""]
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Life Support",
              "texts": [
                {
                  "text": "Changed functionality: Morales now receives all movement speed bonuses from the target she's healing"
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Clear",
              "texts": [
                {
                  "text": "Changed functionality: Morales now reduces the displacement Grenade cooldown by 3 seconds hitting 2 targets"
                },
                {
                  "text": "Quest:Hit 3 targets with displacement Grenade | Reward: Reduces Clear cooldown to 6 seconds"
                },
                {
                  "text": "Quest:Hit 4 targets with displacement Grenade | Reward: Reduces Clear cooldown to 9 seconds"
                }
              ],
              "developerCommentary": ""
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "name": "Cellular Reactor",
              "texts": [
                {
                  "text": "There's no more energy cost"
                },
                {
                  "text": "Cooldown increased to 30 seconds"
                },
                {
                  "text": "Prevents Morales from losing Energy when dying"
                }
              ],
              "developerCommentary": ""
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "name": "Emp grenade, Sytem Shock and Beside manner",
              "texts": [
                {
                  "text": "Moved from level 7."
                }
              ],
              "developerCommentary": "The displacemente grenade talent tier ain't so strong and the new talents created for Medivac are sorta strong so i'm changing positions to level 7 for better power spikes."
            },
            {
              "name": "Physical Therapy, Vanadium Plating and Medi-drone",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "With tha baseline kit changes there's no more room for this talents"
            }
          ]
        },
        {
          "name": "Level 10",
          "changes": [
            {
              "name": "Kritzroid",
              "texts": [
                {
                  "text": "Steroids charge now make allied heros basic attacks deals extra 30% damage"
                }
              ],
              "developerCommentary": "Didn't want to just buff attack speed an movement speed as a simple buff and wanted to make something that remember that kritzkrieg from TF2. Perfect time to make Morales a freaking problem considering that some characters are insane troubles with higher attack damage."
            },
            {
              "name": "Caffeineroids",
              "texts": [
                {
                  "text": "Increase Steroids charge movement speed bonus by 25% and makes target unkillable."
                }
              ],
              "developerCommentary": "The risk plays with Morales, remember that healing beam can be cancelled with crowd control."
            },
            {
              "name": "Get back to the fight-roids",
              "texts": [
                {
                  "text": "Targets receives an additional healing equals to 330% healing of the Healing Beam"
                }
              ],
              "developerCommentary": "I wanted to give it 300% of the original Healing Beam value."
            }
          ]
        },
        {
          "name": "Level 13",
          "changes": [
            {
              "name": "There's always room for one more",
              "texts": [
                {
                  "text": "Medivac now takes off 5 seconds after it being used and can carry any amount of people."
                }
              ],
              "developerCommentary": "It's supposed to work like League of legends https://leagueoflegends.fandom.com/wiki/Redemption"
            },
            {
              "name": "Ambulance driving",
              "texts": [
                {
                  "text": "Now Medivac calls upon Morales after 1 second of channeling, the medivac is 150% faster and have the cooldown reduced by half plus instantly taking off as soon it's used."
                }
              ],
              "developerCommentary": "This works very close to how the old Medivac was but only morales will ride it."
            },
            {
              "name": "Reinforcements",
              "texts": [
                {
                  "text": "Call down a Medivac Dropship at your Hall of Storms for your allies. After 10 seconds, or when a hero enters, the Medivac will travel to the target location to unload the passenger."
                }
              ],
              "developerCommentary": "Changed it to hold only one person and also drop it where Morales want for increase her map control potential"
            },
            {
              "name": "Emp grenade, Sytem Shock and Beside manner",
              "texts": [
                {
                  "text": "Moved to level 7."
                }
              ],
              "developerCommentary": "The displacemente grenade talent tier ain't so strong and the new talents created for Medivac are sorta strong so i'm changing positions to level 7 for better power spikes."
            }
          ]
        },
        {
          "name": "Level 16",
          "changes": [
            {
              "name": "First Responder",
              "texts": [
                {
                  "text": "Increase the energy threshold to 90 energy and increase the "
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Shield Sequencer",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Grenade Outreach",
              "texts": [
                {
                  "text": "Increase displacement Grenade area by 10%, each hero hit increase the next displacement grenade area by extra 7.5%"
                }
              ],
              "developerCommentary": ""
            }
          ]
        },
        {
          "name": "Level 20",
          "changes": [
            {
              "name": "Focus Morales!",
              "texts": [
                {
                  "text": "When Morales dies every hero nearby will receive the overcharge effects for 4 seconds"
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Healing beacon",
              "texts": [
                {
                  "text": "Morales drops a beacon with 1200 health. If Morales redirect her healing beam to the beacon all allied heros within 6.5 range of that beacon will receive the Healing Beam and overcharge effects used by Morales."
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "I am ambulance!",
              "texts": [
                {
                  "text": "Activate to increase Morales movement speed by 125% and grant her unstopabble for 4 seconds."
                },
                {
                  "text": "Passive: increase her energy generation by 25%"
                }
              ],
              "developerCommentary": ""
            },
            {
              "name": "Hospice care, Second opinion",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": ""
            }
          ]
        }
      ]
    }
  ]
}
