{
  "id": 5,
  "name": "Lt-Morales",
  "role": "Healer",
  "image": "heroes_portraits/lt-morales.webp",
  "patchNotes": [
    {
      "id": 1,
      "title": "Talent and hero rework",
      "general": [],
      "developerCommentary": "I believe Morales is either the top or at least among the top three most boring characters to play right now, according to a significant portion of the community. After considering these opinions, I agree with the players: Morales feels more like a tool for the team rather than a hero. You lack agency, and your role is reduced to a walking bot that simply presses Q on someone. The changes I propose are inspired by what I consider the ideal healing beam character, the TF2 Medic. I aim to give Morales a similar level of agency and introduce some risks.",
      "general": [
        {
          "change": "Stats",
          "texts": [
            {
              "text": "Morales no longer has energy regeneration and starts with 0."
            }
          ],
          "developerCommentary": "This change is due to modifications in her ultimate ability."
        },
        {
          "change": "Healing Beam (Q)",
          "texts": [
            {
              "text": "No more energy cost."
            },
            {
              "text": "Healing reduced by 30%."
            }
          ],
          "developerCommentary": "The removal of the energy cost necessitated a nerf."
        },
        {
          "change": "Safeguard (W)",
          "texts": [
            {
              "text": "Removed."
            }
          ],
          "developerCommentary": "Safeguard is a skill that predisposes Morales to being a healbot, as it provides additional survivability to another character without the need for precise timing like a cleanse or Medivh's Force of Will. It can be used indiscriminately. I believe it's unhealthy for Morales to have a kit that encourages passive gameplay, which is why I am removing this skill."
        },
        {
          "change": "Medivac Dropship (W)",
          "texts": [
            {
              "text": "Moved from level 10."
            },
            {
              "text": "Morales now doesn't start on the Medivac."
            },
            {
              "text": "The Medivac will fly to the target location with the first hero that enters."
            },
            {
              "text": "Reduces the Medivac duration on land to 3 seconds."
            },
            {
              "text": "Heroes are prevented from entering the Medivac while taking damage."
            }
          ],
          "developerCommentary": "The Medivac is one of the few tools that gives Morales agency. It allows for rapid transport of players between map areas. By converting this ultimate-level skill into a basic ability, some adjustments are necessary for balance and practicality."
        },
        {
          "change": "New: Steroids Charge (R)",
          "texts": [
            {
              "text": "You start with your ultimate now."
            },
            {
              "text": "Costs 100 energy."
            },
            {
              "text": "Activate to grant the current Healing Beam target a 50% increase in attack speed and a 10% movement speed bonus for 6 seconds. Redirecting the healing beam allows the previous target to retain the charge for 0.5 seconds."
            },
            {
              "text": "Gains 2 energy for every 125 health healed. Morales loses all energy upon death."
            }
          ],
          "developerCommentary": "As previously mentioned, I want to bring Morales closer to the gameplay experience of the Medic in TF2. Introducing Steroids as a baseline skill that charges up enhances Morales' engagement in gameplay, focusing on skillful play rather than passive cooldown management. This also distinguishes her from other healers."
        }
      ],
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "name": "Caduceus Feedback",
              "texts": [
                {
                  "text": "Energy grant per basic attack reduced from 4 to 1."
                }
              ],
              "developerCommentary": "Balancing the talent for the new ultimate"
            },
            {
              "name": "Life Support",
              "texts": [
                {
                  "text": "Changed functionality: Morales now receives all movement speed bonuses from the target she's healing."
                }
              ],
              "developerCommentary": "There's no more need for the energy BUT there's always a need for giving Morales a chance to heal junkrat with the fast mount and also follow the steroids target"
            },
            {
              "name": "Clear",
              "texts": [
                {
                  "text": "Changed functionality: Morales now reduces the Displacement Grenade cooldown by 3 seconds when hitting 2 targets."
                },
                {
                  "text": "Quest: Hit 3 targets with Displacement Grenade | Reward: Reduces Clear cooldown to 6 seconds."
                },
                {
                  "text": "Quest: Hit 4 targets with Displacement Grenade | Reward: Reduces Clear cooldown to 9 seconds."
                }
              ],
              "developerCommentary": "I rebalanced the quest so we could preserve the grenade quest and bring earlier the grenade reset"
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "name": "Cellular Reactor",
              "texts": [
                {
                  "text": "No more energy cost."
                },
                {
                  "text": "Cooldown increased to 30 seconds."
                },
                {
                  "text": "Prevents Morales from losing energy upon death."
                }
              ],
              "developerCommentary": "Rebalanced it for the new energy settings"
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "name": "EMP Grenade, System Shock, and Bedside Manner",
              "texts": [
                {
                  "text": "Moved from level 13."
                }
              ],
              "developerCommentary": "The Displacement Grenade talent tier was not very strong, and the new talents created for Medivac are somewhat stronger, so I'm shifting them to level 7 for better power spikes."
            },
            {
              "name": "Physical Therapy, Vanadium Plating, and Medi-drone",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "With the baseline kit changes, there's no more room for these talents."
            }
          ]
        },
        {
          "name": "Level 10",
          "changes": [
            {
              "name": "New: Kritzroid",
              "texts": [
                {
                  "text": "Steroids charge now makes allied heroes' basic attacks deal an extra 30% damage."
                }
              ],
              "developerCommentary": "I didn't want to just buff attack speed and movement speed as a simple buff and wanted to make something that reminds me of the Kritzkrieg from TF2. Perfect time to make Morales a significant problem considering that some characters are troublesome with higher attack damage."
            },
            {
              "name": "New: Caffeineroids",
              "texts": [
                {
                  "text": "Increase Steroids charge movement speed bonus by 25% and makes the target unkillable."
                }
              ],
              "developerCommentary": "The risk plays with Morales, remember that the healing beam can be cancelled with crowd control."
            },
            {
              "name": "New: Get back to the fight-roids",
              "texts": [
                {
                  "text": "Targets receive additional healing equal to 330% of the Healing Beam."
                }
              ],
              "developerCommentary": "I wanted to give it 300% of the original Healing Beam value."
            },

            {
              "name": "Medivac Dropship",
              "texts": [
                {
                  "text": "Moved to baseline (W)."
                }
              ]
            },

            {
              "name": "Stim Drone",
              "texts": [
                {
                  "text": "Removed."
                }
              ]
            }
          ]
        },
        {
          "name": "Level 13",
          "changes": [
            {
              "name": "New: There's always room for one more",
              "texts": [
                {
                  "text": "Medivac now takes off 5 seconds after being used and can carry any amount of people."
                }
              ],
              "developerCommentary": "It's supposed to work like before for any nostalgic player."
            },
            {
              "name": "New: Ambulance driving",
              "texts": [
                {
                  "text": "Now Medivac calls upon Morales after 1 second of channeling, the Medivac is 150% faster and has the cooldown reduced by half plus instantly taking off as soon as it's used."
                }
              ],
              "developerCommentary": "This works very close to how the old Medivac was, but only Morales will ride it."
            },
            {
              "name": "Reinforcements",
              "texts": [
                {
                  "text": "(Active)Call down a Medivac Dropship at your Hall of Storms for your allies. After 10 seconds, or when a hero enters, the Medivac will travel to the target location to unload the passenger (Shares cooldown with medivac dropship)"
                }
              ],
              "developerCommentary": "Changed it to hold only one person and also drop it where Morales wants for increased map control potential."
            },
            {
              "name": "EMP Grenade, System Shock, and Bedside Manner",
              "texts": [
                {
                  "text": "Moved to level 7."
                }
              ],
              "developerCommentary": "The Displacement Grenade talent tier isn't so strong, and the new talents created for Medivac are somewhat strong, so I'm changing positions to level 7 for better power spikes."
            }
          ]
        },
        {
          "name": "Level 16",
          "changes": [
            {
              "name": "New: Medigrenade",
              "texts": [
                {
                  "text": "Morales' Displacement Grenade now gets bigger the farther it travels, up to 40% extra. On explosion, it also heals allied heroes in the area by 480."
                }
              ],
              "developerCommentary": "Sometimes using the grenade feels like an disadvantage and this is a talent option for this games."
            },
            {
              "name": "Shield Sequencer",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "No more safeguard needed"
            },
            {
              "name": "First Responder",
              "texts": [
                {
                  "text": "Changed functionality: Morales can overheal targets, granting them an overshield up to 20% of their maximum health that rapidly decays after 5 seconds. Healing resets the shield duration."
                }
              ],
              "developerCommentary": "Inspired by the Tf2 medic overheal and bringing some more utility for late game Morales"
            }
          ]
        },
        {
          "name": "Level 20",
          "changes": [
            {
              "name": "New: Focus Morales!",
              "texts": [
                {
                  "text": "When Morales dies, every hero nearby will receive the Steroids Charge effects for 4 seconds."
                }
              ],
              "developerCommentary": "Now the people on ranked will think twice before saying that"
            },
            {
              "name": "New: Healing Beacon",
              "texts": [
                {
                  "text": "Morales drops a beacon with 1200 health for 15 seconds. If Morales redirects her healing beam to the beacon, all allied heroes within 6.5 range of that beacon will receive the Healing Beam and overcharge effects used by Morales.(60 sec de cooldown)"
                }
              ],
              "developerCommentary": "I always saw an opportunity to make Morales area healing a thing and with the Steroids Charge changes it gets even better"
            },
            {
              "name": "New: I am Ambulance!",
              "texts": [
                {
                  "text": "Activate to increase Morales' movement speed by 125% and grant her unstoppable for 4 seconds.(Cooldown 45 seconds)"
                },
                {
                  "text": "Passive: Increase her energy generation by 25%."
                }
              ],
              "developerCommentary": "This is made to be the ultimate safe talento for Morales..i wanted to go more on a Soraka from Lol passive route but i taught this would be funnier and better."
            },
            {
              "name": "Hospice Care, Second Opinion",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "Second opinion now comes earlier and hospice care have no more space in the game"
            }
          ]
        }
      ]
    }
  ]
}
