{
  "id": 61,
  "name": "RAYNOR",
  "role": "Ranged Assassin",
  "image": "heroes_portraits/raynor.webp",
  "patchNotes": [
    {
      "id": 60,
      "title": "Hero mini-rework and talent rework",
      "general": [
        {
          "change": "New: Drop Pod",
          "texts": [
            {
              "text": "Activate to respawn at the targeted position instead of the halls of the storm dealing 200 damage on contact."
            },
            {
              "text": "The <modified, abilities, basic, 3> animation takes 2 seconds"
            }
          ],
          "developerCommentary": "This change is made to have a better approach on the fantasy of a Terran Soldier with the <modified, abilities, basic, 3>."
        }
      ],
      "developerCommentary": "For me Raynor is on a good path to represent what being a Terran Marine or Jim Raynor represents the objective here is to give him more utility tools and approach him more of the one we know from starcraft 2",
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "change_id": "raynor_1",
              "name": "<vanilla, talents, 1, 2>",
              "texts": [
                {
                  "text": "Changed functionality: Quest: Hitting <modified, abilities, basic, 0> increase the slow by 5% up to 5 times. When on max stacks increase raynor damage by 15%. Stacks are lost on miss"
                },
                {
                  "text": "Increase <modified, abilities, basic, 0> slow duration by 2 seconds"
                }
              ],
              "developerCommentary": "<vanilla, talents, 1, 2> compete with <vanilla, talents, 1, 1> on being a damage talent but on the safe way and with being sincere it's hard to compete with the fun on making DINGS DINGS with <vanilla, talents, 1, 1> and besides i wanted to make this talent still be on the same direction but increasing it's output.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "change_id": "raynor_2",
              "name": "<vanilla, talents, 4, 2>",
              "texts": [
                {
                  "text": "Changed functionality: <modified, abilities, trait, 0> heals 2% maximum health double the amount when the primary target is a hero. Quest:Every time <modified, abilities, trait, 0>'s primary target is a hero gain an additional 40 after reaching 400 health each stack will now give 8 maximum health instead. Loses the bonus health on death"
                }
              ],
              "developerCommentary": "I like both <vanilla, talents, 4, 1> and <vanilla, talents, 4, 2> but i first dislike a second mission of infinite stacking and also i would say that both these quests synergise well and could aggregate.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "raynor_2",
              "name": "<vanilla, talents, 4, 1>",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "With the changes to <modified, talents, 4, 2> there's no need for it anymore",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "raynor_3",
              "name": "NEW: Raynor raiders",
              "texts": [
                {
                  "text": "Deploy a terran pod that deals 200 damage on contact with 3 marines and 1 medic that will go towards the closest lane to push."
                },
                {
                  "text": "This units can grab experience globes"
                },
                {
                  "text": "Shares Raynor Drop Pod talents"
                },
                {
                  "text": "Cooldown: 45s"
                },
                {
                  "text": "Range: global"
                }
              ],
              "developerCommentary": "The intent here is to bring more of the leadership that Raynor has on the campaign of Starcraft 2 being a tool more focused on Macro or vision.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "change_id": "raynor_4",
              "name": "<vanilla, talents, 7, 0> renamed to Old Times",
              "texts": [
                {
                  "text": "Changed functionality: Raynor always rides his Vulture instead of the normal mount. The first shot after dismounting deals 50% extra damage and slows the target by 40% for 2 seconds."
                }
              ],
              "developerCommentary": "<vanilla, talents, 7, 0> always felt kinda eeh and would only be picked on big numbers. I'm changing it for something that level 7 doesn't cover and giving a damage option instead of the utility/healing options.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 16",
          "changes": [
            {
              "change_id": "raynor_7",
              "name": "<vanilla, talents, 16, 2> renamed to We all got our choices to make ",
              "texts": [
                {
                  "text": "Changed functionality: Activate to make a pistol shoot on a straight line dealing 250 damage to the first enemy hero that it hits applying exhaustion that preventing it from using any dash or similar for the next 4 seconds."
                },
                {
                  "text": " Passive: If <modified, abilities, trait, 0>'s primary target is a hero it receives additional 3% of their maximum health as damage."
                },
                {
                  "text": " Cooldown 30 seconds."
                },
                {
                  "text": " Range 8 ( Penetrating round has 9.5 range )."
                }
              ],
              "developerCommentary": "I first wanted to add a flashbang grenade for Raynor who would make a similar effect but bringing one of the most iconic moments of SC2 wings of liberty seems a better choice. Gameplay wise this is to be an optional talent against Mobile targets further make Raynor a good counter to them. And why change it from the original? It's because the results are somewhat similar to Rallying cry with the big difference being about killing high life targets but that doesn't mean you couldn't do it alredy with Rallying cry so im making it an more uility based rather than a direct option.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 20",
          "changes": [
            {
              "change_id": "raynor_5",
              "name": "<vanilla, talents, 20, 0>",
              "texts": [
                {
                  "text": "Changed functionality: Activate for <modified, abilities, heroic, 0> to fire the Yamato Cannon at the target location dealing 450 damage after 1.25 seconds."
                },
                {
                  "text": "3.0 radius ( The size of a probius warp rift )"
                },
                {
                  "text": "20s cooldown"
                },
                {
                  "text": "Additionaly if Raynor respawn from a <modified, abilities, basic, 3> he will inspire nearby units"
                }
              ],
              "developerCommentary": "<modified, abilities, heroic, 0> by itself doesn't feel strong as we imagine coming from the Starcraft 2 perspective and it further diminishes this effect by using it as a Siege ultimate by having no control of the Yamato Cannon. <vanilla, talents, 20, 0> current effect do not make Hyperion upgrade feel and act powerful but rather incentivize the ultimate spam.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "raynor_6",
              "name": "<vanilla, talents, 20, 4>",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "Especially with the new Ressurect <modified, abilities, basic, 3> this could lead to extremely toxic gameplay.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        }
      ]
    }
  ]
}
