{
  "id": 1,
  "name": "REXXAR",
  "role": "Bruiser",
  "image": "heroes_portraits/rexxar.webp",
  "patchNotes": [
    {
      "id": 1,
      "title": "Hero Rework",
      "general": [
        {
          "change_id": "rexxar_1",
          "change": "Spirit Swoop",
          "texts": [
            {
              "text": "No longer slows enemies."
            },
            {
              "text": "Additional functionality: Spirit stays at the end of the skill for 2 seconds, providing a big area vision upon reaching it's end. Spirit will automatically divebombs the closest Hero on the end of duration, dealing 120 damage and slowing by 50% (decays over 3 seconds), then returns to Rexxar."
            },
            {
              "subtexts": [
                "Spirit Swoop cooldown only starts when it returns to Rexxar.",
                "The vision radius is 10 | Timerwalker's Pursuit Chromie vision is 10",
                "Will only divebomb enemies on vision radius, if there's no enemy on vision radius won't divebomb anyone and will just return to Rexxar"
              ]
            }
          ],
          "developerCommentary": "Spirit Swoop is currently a simple skillshot that slows and damages enemies in a straight line, underutilizing the concept of Spirit, a bird dedicated to scouting. Inspired by Beastmaster from Dota 2, I wanted to give Spirit a better role while increasing Rexxar's decision-making without creating a new active ability.",
          "likes": 0,
          "likedBy": {}
        },
        {
          "change_id": "rexxar_2",
          "change": "Misha, Focus!",
          "texts": [
            {
              "text": "Additional functionality: Misha Independence (active): Switch between Misha's automatic and manual modes. In automatic mode, Misha, Focus! changes to Offensive and Defensive behaviors. In Offensive Mode, Misha targets any enemy hero within leash range. In Defensive Mode, Misha focuses on enemies close to Rexxar."
            }
          ],
          "developerCommentary": "While I aimed to increase Rexxar's skill floor, I find it acceptable to create a more casual-friendly version of Rexxar, even if it performs slightly worse compared to manual mode.",
          "likes": 0,
          "likedBy": {}
        }
      ],
      "developerCommentary": "Rexxar, despite not underperforming, lacks depth due to a straightforward kit centered around managing two characters with simplistic abilities. This simplicity is acceptable given the challenge of controlling multiple entities, but Rexxar's identity as a Beastmaster is underutilized. Enhancing his complexity is justified to cater to high-skill-cap players, focusing on deepening the strategic and visual appeal of Rexxar's Beastmaster persona.",
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "change_id": "rexxar_3",
              "name": "New: Meat Mending",
              "texts": [
                {
                  "text": "Empowers Misha's next basic attack, reducing its target's healing received by 75% for 1.25 seconds when Mend Pet is used."
                }
              ],
              "developerCommentary": "One of the many changes I want for Rexxar is to give more strategic uses for Mend Pet, encouraging players to hold the skill and use it in different ways.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_4",
              "name": "Animal Husbandry",
              "texts": [
                {
                  "text": "Moved from level 4."
                },
                {
                  "text": "Regeneration globes now give 10 extra stacks and kills 25 stacks."
                },
                {
                  "text": "Max stacks are capped at 500, increasing by 100 every level."
                }
              ],
              "developerCommentary": "Animal Husbandry should be a commitment from level 1, showcasing the player's dedication and spreading defensive talents across Rexxar's skill tree.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_5",
              "name": "Thrill of the Hunt",
              "texts": [
                {
                  "text": "Moved from level 16."
                },
                {
                  "text": "Changed functionality: Rexxar's basic attacks increase Misha's movement speed by 25%. If Misha gets close to Rexxar after stunning a target with Misha, Charge!, Rexxar gains 20% movement speed for 4 seconds."
                }
              ],
              "developerCommentary": "At level 1, I want to make it easier to mix defensive and offensive talents, with Thrill of the Hunt empowering a different playstyle.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_6",
              "name": "Flare, Easy Prey",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "With the Spirit Swoop changes, Flare is no longer needed as it would overlap. Easy Prey covers a role that Rexxar shouldn't take.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_7",
              "name": "Bird of Prey",
              "texts": [
                {
                  "text": "Moved to level 4."
                }
              ],
              "developerCommentary": "Rexxar shouldn't focus on wave clear from level 1. Instead, he should take a more oppressive stance in solo lane duels, being a punisher.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "change_id": "rexxar_8",
              "name": "Bird of Prey",
              "texts": [
                {
                  "text": "Additional functionality: Spirit Swoop vision will stay for 3 seconds after Spirit comes back."
                },
                {
                  "text": "Additional functionality: If Spirit Swoop hits no targets on the initial cast reduces it's cooldown by 4 seconds and refunds mana."
                },
                {
                  "text": "Moved from level 1."
                }
              ],
              "developerCommentary": "With the changes to Spirit, this talent is weaker if you wish to use its vision. As a level 4 talent competing with survivability talents bringing the 'flare' survavibility could make it a good choice. ",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_9",
              "name": "Hungry Bear renamed to Hungry Animals",
              "texts": [
                {
                  "text": "Additional functionality: Misha now kills enemy troops instantly with basic attacks and recovers 2.25% health."
                },
                {
                  "text": "Additional functionality: When Spirit divebombs an enemy hero, it heals Rexxar for 12.5% of his maximum health."
                }
              ],
              "developerCommentary": "With the changes to Spirit, it's the perfect opportunity to make this talent a reliable choice.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_10",
              "name": "New: Misha Protect",
              "texts": [
                {
                  "text": "When Misha stays close to Rexxar, both receive 25 armor and reduced crowd control effect durations by 35%."
                },
                {
                  "text": "The intended range is something close to 2, almost melee range"
                }
              ],
              "developerCommentary": "A talent to help Rexxar against dive comps.",
              "likes": 0,
              "likedBy": {}
            },

            {
              "change_id": "rexxar_12",
              "name": "Hunter Gatherer, Grizzled Fortitude",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "I dislike generic talents. These talents do not utilize Rexxar's skills creatively.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_13",
              "name": "Animal Husbandry",
              "texts": [
                {
                  "text": "Moved to level 1."
                }
              ],
              "developerCommentary": "Show your dedication from level 1.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "change_id": "rexxar_14",
              "name": "Crippling Talons",
              "texts": [
                {
                  "text": "Changed functionality: Spirit divebomb's slow is now increased to 60% and doesn't decay anymore."
                }
              ],
              "developerCommentary": "Changing Crippling Talons to still be an effective slowing skill but more inclined to the new Spirit Swoop mechanics.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_15",
              "name": "Bestial Wrath",
              "texts": [
                {
                  "text": "Moved from level 10."
                },
                {
                  "text": "Changed functionality: (Passive) Misha's basic attacks against enemy heroes grant a stacking 25% increased attack damage bonus for 4 seconds, up to a maximum of 300%."
                }
              ],
              "developerCommentary": "I don't dislike the effects of Bestial Wrath, but I found it too simple and not worth a high cooldown active for dynamic purposes. Instead, I wanted to make it similar to Tyrande's Darnassian Archery and put it on level 7 to increase how you want to optimize your build, damage|utility|control talents for level 7.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 10",
          "changes": [
            {
              "change_id": "rexxar_16",
              "name": "Bestial Wrath",
              "texts": [
                {
                  "text": "Moved to level 7."
                }
              ],
              "developerCommentary": "Heroes of the Storm ultimates generally make the player feel powerful and distinct. Bestial Wrath, in my opinion, does not give that feeling and rather feels like an active talent that could fit either on level 13 or 16.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_11",
              "name": "New: Animal companions",
              "texts": [
                {
                  "text": "Rexxar calls Huffer his boar companion to aid him in battle. Huffer will have 1200 HP and 5 attack range and will be controlled by Focus, Huffer!, a skill command that works similarly to Misha, Focus!. After engaging in combat with heroes for atleast 5 seconds Huffer will have increased 40% attack speed and 25% movement speed. This bonus is lost if Huffer doesn't hit heroes for 3 seconds.",
                  "subtexts": [
                    "Huffer will work similar as Misha, giving exp to the enemy team on kill and having the same respawn time."
                  ]
                },
                {
                  "text": "Passive: Increase Rexxar companions leash range by 30%."
                }
              ],
              "developerCommentary": "Further exploring the Rexxar Beastmaster gameplay and besides Summoners are a great problem on Moba games so for this reason im not letting it play automatic to justify.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 13",
          "changes": [
            {
              "change_id": "rexxar_18",
              "name": "Wildfire Bear",
              "texts": [
                {
                  "text": "Additional functionality: Increases Misha's size by 20%."
                },
                {
                  "text": "While under Mend Pet effect, increases Wildfire Bear damage by 100%."
                }
              ],
              "developerCommentary": "Initially, I wanted to remove Wildfire Bear, but now I see an opportunity to bring two things I wanted: a talent that increases Misha's size for better body blocking and also increases Mend Pet interactions.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 16",
          "changes": [
            {
              "change_id": "rexxar_19",
              "name": "Primal Intimidation renamed to Ambush",
              "texts": [
                {
                  "text": "Entering bushes grants Rexxar or his pets invisibility for 3 seconds.",
                  "subtexts": ["5 seconds cooldown for each one"]
                }
              ],
              "developerCommentary": "Hunters should know the jungle and it also grants a great power to ambush or either escape from engages all on a hunter lore.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_20",
              "name": "New: Beast Roar",
              "texts": [
                {
                  "text": "Knocks back enemies around Misha by a significant distance when Mend Pet is used."
                },
                {
                  "text": "The radius is supposed to be 3.5, a little smaller than E.T.C face melt"
                }
              ],
              "developerCommentary": "The knockback is intended to be smaller than Lucio's Soundwave, just enough for Misha to cancel enemy animations.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_21",
              "name": "Thrill of the Hunt",
              "texts": [
                {
                  "text": "Moved to level 1."
                }
              ],
              "developerCommentary": "We are being thrilled faster now, but seriously, I wanted to provide more fun ways to change Rexxar at level 16 instead of just movement speed.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 20",
          "changes": [
            {
              "change_id": "rexxar_22",
              "name": "New: Leokk",
              "texts": [
                {
                  "text": "Summons Leokk to inspire nearby allied heroes, increasing their attack speed by 40% in an area. Leokk will have 1200 HP and will be automatically following Rexxar  close to his back. Rexxar can activate Leokk, Follow! To change the target Leokk will follow.",
                  "subtexts": [
                    "Leokk will work similar as Misha, giving exp to the enemy team on kill and having the same respawn time."
                  ]
                },
                {
                  "text": "Passive: Removes animal companions leash max range."
                }
              ],
              "developerCommentary": "A common complaint, which I agree with, is that Rexxar could be more challenging by utilizing the Beastmaster fantasy. I want to bring that with Leokk.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_17",
              "name": "New: Stampede",
              "texts": [
                {
                  "text": "Channel to call down hordes of rampaging thunder lizards that explode around Rexxar's enemies for 3 seconds. The lizards appear in parallel lines on either side of Rexxar, each explosion dealing 120 damage."
                },
                {
                  "text": "The stampede area will cover two parallel lines on Rexxar's sides."
                }
              ],
              "developerCommentary": "Stampede is a Rexxar classic from the Warcraft 3 era, but it's a challenging ultimate to implement because it works similarly to March of the Murlocs. Changing the area Stampede covers was the best solution to give it a distinct feel while avoiding the randomness similar to Gul'dan's Rain of Chaos.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_24",
              "name": "New: Bond of Sacrifice",
              "texts": [
                {
                  "text": "If Rexxar takes a fatal hit while Misha is alive, Misha will die and heal Rexxar for Misha's remaining HP."
                }
              ],
              "developerCommentary": "After reading some of Rexxar's lore to better understand new talents I could create, I found out about Haratha and saw a perfect opportunity to make a reference that could still make sense and be useful/dynamic for a level 20 talent, and also fun.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "rexxar_25",
              "name": "Frenzy of Kalimdor, Hardened Skin, Spirit Bond",
              "texts": [
                {
                  "text": "Removed."
                }
              ],
              "developerCommentary": "I dislike having generic talents in builds and will probably hold this line of thinking until the end. Spirit Bond is a Bestial Wrath upgrade that I don't see any use for right now.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        }
      ]
    }
  ]
}
