{
  "id": 1,
  "name": "TYCHUS",
  "role": "Ranged Assassin",
  "image": "heroes_portraits/tychus.webp",
  "patchNotes": [
    {
      "id": 1,
      "title": "Hero changes and Talent Rework",
      "general": [
        {
          "change_id": "tychus_1",
          "change": "Minigun (T)",
          "texts": [
            {
              "text": "Additional functionality: You can reactive minigun to activate it earlier"
            },
            {
              "text": "Additional functionality: Overkill is also affected by Minigun with 50% of the effect",
              "subtexts": [
                "Everyone hit is affected by the Minigun",
                "Using Overkill DOESN'T activate the minigun effect you need to manually activate it or basic attack someone"
              ]
            }
          ],
          "developerCommentary": "This is a change both for QoL on the situations you press Minigun and can't hit a hero so minigun trait is activated and you can't do anything and also to combo with the new Overkill Mechanic better. The new Overkill interaction is worse on single targets but better on area damage as the Overkill stacks less hits(3.0second) in comparison of the basic attacks(4.0second) but with the advantage of hitting on area.",
          "likes": 0,
          "likedBy": {}
        }
      ],
      "developerCommentary": "I like Tychus but some talents of it's build are into a funnel shape so for my vision i made adjustments on those talents to prevent that making it that you can pick any talent for any build and also changing how Drakkin works so it's more reliable.",
      "sections": [
        {
          "name": "Level 1",
          "changes": [
            {
              "change_id": "tychus_2",
              "name": "New talent: Stun and Gun",
              "texts": [
                {
                  "text": "At the end of Run and Gun, enemies in front of Tychus will be stunned for 0.75 seconds and will have their physical armor reduced by 40 for 2 seconds, as Tychus hits them with the butt of his minigun.",
                  "subtexts": [
                    "Range: 1.5 on a 45ยบ radius. It should perform as an very small arc"
                  ]
                }
              ],
              "developerCommentary": "This is a talent to better benefit Tychus players who go for ambushing the solo laner instead of following the tank, it can also be used for that but only for extreme agressive gameplay",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_3",
              "name": "Quarterback",
              "texts": [
                {
                  "text": "Moved to level 7"
                }
              ],
              "developerCommentary": "One of the big problems is that this talent is too good and too much fun so i changed it for a only grenade tier for better control on how you want to handle grenade talents",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_4",
              "name": "Press the advantage",
              "texts": [
                {
                  "text": "Additional bonus: Hitting the same target will increase Tychus attack speed by 2% for each basic attack he hits it. Bonus reset every time he hits another target."
                }
              ],
              "developerCommentary": "It's not bad as it is but has more potential to have some kind of niche",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 4",
          "changes": [
            {
              "change_id": "tychus_5",
              "name": "Master Assassin",
              "texts": [
                {
                  "text": "removed"
                }
              ],
              "developerCommentary": "The only sole reason for that to be picked is to increase the Odin attack speed and for that i think there's better options to be explored on that tier and i would prefer that talent to be more stylish ",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_6",
              "name": "The Bigger They Are...",
              "texts": [
                {
                  "text": "Additional bonus: Reduces the cooldown of Minigun by 4 seconds after using Run and Gun"
                }
              ],
              "developerCommentary": "This is a hard talent to either nerf or buff on numerical reasons i feel like mixing it with combat tactician could help it to better balance it.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_7",
              "name": "That's the Stuff!",
              "texts": [
                {
                  "text": "Moved from level 13"
                }
              ],
              "developerCommentary": "The biggest reason to bring That's the Stuff is to make the player choose on how he wants the minigun to behave for the entire game, choose between killing a target, extended duration or self-healing.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 7",
          "changes": [
            {
              "change_id": "tychus_8",
              "name": "Relentless soldier",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": "It's not bad it's about a choice i am making to change how the level 7 tier works.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_9",
              "name": "New Talent: KD9a Implosion Core",
              "texts": [
                {
                  "text": "Tychus grenade will pull targets to it's center now."
                },
                {
                  "text": "Increase explosion radius by 15%."
                }
              ],
              "developerCommentary": "Based on Tychus from Sc2 it could give another type of utility for Tychus",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_10",
              "name": "Quarterback",
              "texts": [
                {
                  "text": "Moved from level 1"
                },
                {
                  "text": "Won't increase damage anymore"
                },
                {
                  "text": "Reduces armor of enemy heros hit by 15 for 3 seconds"
                }
              ],
              "developerCommentary": "Bringing that talent to level 7 means it would directly compete with damage with melting point so instead im changing it for something similar but that provide another use",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_11",
              "name": "Combat tactician",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": "By mixing it with The Bigger They Are and with the way i am changing the talent tree i see no reason to that exist",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 10",
          "changes": [
            {
              "change_id": "tychus_12",
              "name": "Drakken Laser Drill",
              "texts": [
                {
                  "text": "Changed functionality: The Drakken Laser Drill now spawns at the Halls of the Storm and targets the closest enemy unit to Tychus, dealing 142 (+4% per level) damage per second. It will switch targets every 3 seconds or instantly if the current target dies. Activating the Drakken Laser Drill allows you to select a target. After 2 seconds, the laser will fire a high-damage continuous beam at the target's position, stunning enemies for 0.5 seconds and dealing damage over 3 seconds.",
                  "subtexts": [
                    "The laser activation will not follow the target but will stay on the target position after it start BEAMING.",
                    "The Activated beam radius is 2.0 | Sgt.Hammer Napalm strike radius is 2.0",
                    "The laser range is global but it will ALWAYS target the closest visible enemy target to Tychus doesn't matter if its a hero or troop but will always prefer the closest hero on a 10 range from Tychus.",
                    "The laser will only START focusing on visible targets but won't leave the current target no matter what happens.",
                    "It takes 0.5 seconds to change target",
                    "Cooldown 70 seconds to empower"
                  ]
                }
              ],
              "developerCommentary": "One problem i have with the current Drakken Laser is the fighting summonable aspect that can't be changed if it has a fixed duration but i like the idea of Drakken because it's a very important mission that Tychus takes care. For that i want to bring it closer to how it works in game and that means being global BUT i will remove the natural retargetting aspect for not start a Toxic global constant damage ultimate. And also for to better enhance the lore aspect Drakken is global",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "name": "Level 13",
          "changes": [
            {
              "change_id": "tychus_13",
              "name": "Armor Piercing Rounds",
              "texts": [
                {
                  "text": "Moved from level 16"
                }
              ],
              "developerCommentary": "As a talent i consider less important for synergy with any talent from overkill builds i bring it here so i can make this tier the Overkill Talent tree choice and put Spray'n'Pray as the big choice on 16",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_14",
              "name": "Spray'n'Pray",
              "texts": [
                {
                  "text": "Moved to level 16"
                }
              ],
              "developerCommentary": "This talent is the most important if you want to focus on a overkill build because it gives everything extra you would want AND i am putting it on 16 as a very important choice to make.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_15",
              "name": "Can do this all day",
              "texts": [
                {
                  "text": "Moved from level 20"
                },
                {
                  "text": "Cooldown reduction is now reduced by 5 if Tychus complete overkill instead of flat bonus"
                }
              ],
              "developerCommentary": "Nerfing it a little to better suit level 13 and bringing it here as the new defensive talent.",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_16",
              "name": "Neosteel Coating",
              "texts": [
                {
                  "text": "Removed"
                }
              ],
              "developerCommentary": "Again, it's not a bad talent BUT i am changing how that talent tier works and with the Can do this all day i think it would overlap",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_23",
              "name": "New talent:OverExtend",
              "texts": [
                {
                  "text": "After expiring Overkill does an extra hit applying a decaying slow on every enemy hero of 75% for 2.5 seconds."
                },
                {
                  "text": "Passive: Reduce minigun cooldown by 4 seconds."
                }
              ],
              "developerCommentary": "Something that i want to make is a talent that could make Overkill feel a little different somehow and that's a solution a liked. For better targetting melee targets without the need from the Stun and Gun new talent but on with a good synergy with it.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },

        {
          "name": "Level 16",
          "changes": [
            {
              "change_id": "tychus_17",
              "name": "Armor Piercing Rounds",
              "texts": [
                {
                  "text": "Moved to level 13"
                }
              ],
              "developerCommentary": "It was changed to level 13 because it ain't the most necessary talent for the overkill build and i am changing level 13 to be it.",
              "likes": 0,
              "likedBy": {}
            }
          ]
        },
        {
          "change_id": "tychus_19",
          "name": "Level 20",
          "changes": [
            {
              "change_id": "tychus_20",
              "name": "Can do this all day",
              "texts": [
                {
                  "text": "Moved to level 13"
                }
              ],
              "developerCommentary": "Not a bad talent but not strong enough to be here. It could be rebalanced with unstopabble or better bonuses but for me it would be overkill",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_21",
              "name": "Focusing Diodes",
              "texts": [
                {
                  "text": "Changing functionality: When focusing Heroes it will deal extra 3% damage to health per second."
                }
              ],
              "developerCommentary": "On all seriousness i think that's enough to be a good pick by niching it for better usage against tanks",
              "likes": 0,
              "likedBy": {}
            },
            {
              "change_id": "tychus_22",
              "name": "New Talent: Stepping rock",
              "texts": [
                {
                  "text": "Tychus grenade will bounce 2 times, exploding on each one of the bounces",
                  "subtexts": [
                    " I don't know how measure that but it should be enough to bounce and explode with atleast 1 range between each bounce if you pick the talent that pull enemies.",
                    "This sums 3 explosions"
                  ]
                }
              ],
              "developerCommentary": "What can i saw it just sounds fun",
              "likes": 0,
              "likedBy": {}
            }
          ]
        }
      ]
    }
  ]
}
