{
  "abilities": {
    "basic": [
      {
        "name": "Boosters (Q)",
        "description": "Increase D.Va's Movement Speed by 115% for 1.75 seconds. Enemies that are hit take 135 damage and are knocked away. D.Va cannot be Slowed while Boosters are active, and each enemy can only be hit once per use.",
        "image": "dva_boosters.png",
        "abilityChanged": false,
        "cooldown": "10s"
      },
      {
        "name": "Defense Matrix (W)",
        "description": "Project a defensive field in the target direction for 3 seconds, reducing the damage dealt by enemy Heroes inside it by 50%.Activate again to change the angle of projection.Damage dealt to the Mech from enemies within Defense Matrix still grants the same amount of Self-Destruct Charge.",
        "image": "dva_defense_matrix.png",
        "abilityChanged": false,
        "cooldown": "12s"
      },
      {
        "name": "Self-Destruct (E)",
        "description": " Eject from the Mech, setting it to self-destruct after 4 seconds. Deals 400 to 1100 damage in a large area, depending on distance from center. Deals 50% damage against Structures.Gain 1% Charge for every 2 seconds spent Basic Attacking, and 25% Charge per 100% of Mech Health lost.",
        "image": "dva_self_destruct.png",
        "abilityChanged": false
      },
      {
        "name": "Big Shot (R)",
        "description": "Deal 150 damage to all enemies in a line. Heroes hit have their Movement Speed Slowed by 25% for 1.5 seconds. The cooldown of Call Mech is reduced by 5 seconds for each enemy Hero hit.Requires Pilot Mode.",
        "image": "dva_big_shot.png",
        "abilityChanged": false,
        "cooldown": "6s"
      }
    ],
    "heroic": [
      {
        "name": "Bunny Hop (R)",
        "description": "D.Va's Mech becomes Unstoppable and stomps every 0.5 seconds, dealing 70 damage in a large area. Every 4th consecutive hit on a Hero deals 100% more damage and Stuns them for 0.5 seconds.Lasts for 4 seconds.Requires Mech Mode.",
        "image": "dva_bunny_hop.png",
        "abilityChanged": false,
        "cooldown": "70s"
      },
      {
        "name": "Micro Missiles (R)",
        "description": "After .375 seconds, Channel to launch a volley of 12 missiles in a target direction. Each missile impacts the first enemy in its path, dealing 40 damage in a small area and Slowing by 30% for 2 seconds.Stores 2 charges with a 5 second cooldown between each use.Requires Mech Mode.",
        "image": "dva_micro_missiles.png",
        "abilityChanged": false,
        "cooldown": "20s"
      }
    ],
    "trait": {
      "name": "Mech Mode (T)",
      "description": " When D.Va's Mech dies, she is ejected out after 0.75 seconds and can continue to fight. D.Va's Mech only awards 50% of a normal Hero's experience upon dying.Fusion CannonsD.Va's Mech Basic Attacks deal 22 damage in a large area every 0.25 seconds. Deals 40% bonus damage against enemies very close to the Mech.",
      "image": "dva_mech_mode.png",
      "abilityChanged": false
    }
  },
  "1": [
    {
      "name": "Full Metal",
      "description": "D.Va's Mech gains 10% increased Health and its Fusion Cannons heal for 16% of the damage dealt to enemies in its bonus area.",
      "image": "dva_mechmode.png",
      "talentChanged": false
    },
    {
      "name": "Pro Moves",
      "description": "D.Va's Mech gains 2% Movement Speed and 2 Armor every time it takes damage, stacking up to 15 times. Stacks of this effect decay every 0.5 seconds.Basic Attacks against enemy Heroes in Pilot Mode reduce the cooldown of Call Mech by 1 additional second.",
      "image": "dva_mechmode_a.png",
      "talentChanged": false
    },
    {
      "name": "Liquid Cooling",
      "description": "Activate to gain the effects of Healing Fountain. Requires Mech Mode.Passive: While in Mech Mode, Healing Fountain's cooldown is reduced to 50 seconds and its effects last 35% longer.",
      "image": "dva_mechmode_b.png",
      "talentChanged": false,
      "cooldown": "50s"
    }
  ],
  "4": [
    {
      "name": "Rush-down",
      "description": "Boosters deals an additional 2% of maximum Health as damage to Heroes and heals D.Va's Mech for the damage dealt. Boosters deals 50% increased damage to non-Heroic enemies.",
      "image": "dva_boosters.png",
      "talentChanged": false
    },
    {
      "name": "Aggression Matrix",
      "description": "Enemy Heroes within your Defense Matrix receive 35% less healing.Passive: Basic Attacks against Heroes lower the cooldown of Defense Matrix by 0.1875 seconds.",
      "image": "dva_defensematrix.png",
      "talentChanged": false
    },
    {
      "name": "Nuclear Option",
      "description": "Hitting your self-destructing Mech with Big Shot causes it to self-destruct 40% faster.Passive: When Fusion Cannons deal bonus damage to an enemy Hero, gain 0.25 Self-Destruct Charge.",
      "image": "dva_selfdestruct.png",
      "talentChanged": false
    }
  ],
  "7": [
    {
      "name": "Get On The Point!",
      "description": "Casting Boosters grants nearby allies 20% Movement Speed for 2 seconds. Passive: If D.Va has not taken damage in the last 3 seconds, Boosters' cooldown refreshes 100% faster.",
      "image": "dva_boosters.png",
      "talentChanged": false
    },
    {
      "name": "Hit the Nitrous",
      "description": "The initial speed bonus of Boosters is increased to 300%, then decays to normal boost speed over 0.5 seconds. During this time, Boosters Stuns for 0.5 seconds.",
      "image": "dva_boosters_a.png",
      "talentChanged": false
    },
    {
      "name": "Fusion Generator",
      "description": "Every time an enemy Hero deals damage while inside Defense Matrix, D.Va's Self-Destruct Charge increases by 1%. Max of 20% Charge gained per use. Passive: While at full Self-Destruct charge, Fusion Cannons' bonus damage is increased to 100%.",
      "image": "dva_defensematrix.png",
      "talentChanged": false
    }
  ],
  "10": [
    {
      "name": "Bunny Hop",
      "description": "D.Va's Mech becomes Unstoppable and stomps every 0.5 seconds, dealing 70 damage in a large area. Every 4th consecutive hit on a Hero deals 100% more damage and Stuns them for 0.5 seconds.Lasts for 4 seconds.Requires Mech Mode.",
      "image": "dva_bunnyhop.png",
      "talentChanged": false,
      "cooldown": "70s"
    },
    {
      "name": "Micro Missiles",
      "description": "After .375 seconds, Channel to launch a volley of 12 missiles in a target direction. Each missile impacts the first enemy in its path, dealing 40 damage in a small area and Slowing by 30% for 2 seconds.Stores 2 charges with a 5 second cooldown between each use.Requires Mech Mode.",
      "image": "dva_micromissiles.png",
      "talentChanged": false,
      "cooldown": "20s"
    }
  ],
  "13": [
    {
      "name": "Target Locked",
      "description": "Enemy Heroes that remain in your Defense Matrix for 1 seconds have their Armor reduced by 15 and their Movement Speed reduced by 25% for 3 seconds.",
      "image": "dva_defensematrix.png",
      "talentChanged": false
    },
    {
      "name": "Good To Go",
      "description": "Pilot Mode: Unlocks the Torpedo Dash and Concussive Pulse abilities.Torpedo Dash: Dash a short distance. 10 second cooldown.Concussive Pulse: Deal 120 damage to enemies in a cone and knock them back. 10 second cooldown.",
      "image": "dva_pilotmode.png",
      "talentChanged": false
    },
    {
      "name": "Pew! Pew! Pew!",
      "description": "Pilot Mode: Instead of a single shot, Big Shot fires 3 shots over 0.5 seconds. Each shot deals 75% damage.",
      "image": "dva_bigshot.png",
      "talentChanged": false
    }
  ],
  "16": [
    {
      "name": "In For The Kill",
      "description": "Casting Boosters grants a Shield equal to 10% of maximum life for 2.5 seconds. Each Enemy Hero hit by Boosters increases D.Va's Mech's Basic Attack damage by 10% for 5 seconds, stacking up to 5 times.",
      "image": "dva_boosters.png",
      "talentChanged": false
    },
    {
      "name": "Diverting Power",
      "description": "Defense Matrix's area grows drastically in size and each time it reduces damage dealt to Heroes D.Va's Mech is healed for 35 Health.",
      "image": "dva_defensematrix.png",
      "talentChanged": false
    },
    {
      "name": "Emergency Shielding",
      "description": "When D.Va's Mech would be destroyed, it instead gains a Shield that absorbs 280 damage over 4 seconds.This effect has a 30 second cooldown.",
      "image": "dva_mechmode.png",
      "talentChanged": false
    }
  ],
  "20": [
    {
      "name": "Stop and Pop",
      "description": "Increase Bunny Hop's duration by 4 seconds, and it does not decay while D.Va's Mech is stationary.",
      "image": "dva_bunnyhop.png",
      "talentChanged": false
    },
    {
      "name": "Timing Attack",
      "description": "Micro Missiles gains an additional charge. Each time Micro Missiles hits an enemy Hero, reduce its cooldown by 0.5 seconds and charge cooldown by 0.25 seconds.",
      "image": "dva_micromissiles.png",
      "talentChanged": false
    },
    {
      "name": "Headshot!",
      "description": "Pilot Mode: Increase Big Shot's damage by 75% and reduce its cooldown by 2 seconds.",
      "image": "dva_bigshot.png",
      "talentChanged": false
    },
    {
      "name": "Ablative Armor",
      "description": "45% of Spell damage dealt to D.Va's Mech is returned as healing over 4 seconds.",
      "image": "dva_mechmode.png",
      "talentChanged": false
    }
  ]
}