{
  "1": [
    {
      "name": "Rocket Boots",
      "description": "Increase the cast range of Xplodium Charge by 30% and its damage by 35%. Hitting an enemy Hero increases Movement Speed by 20% for 3 seconds.",
      "image": "storm_ui_icon_gazlowe_explodiumcharge.png"
    },
    {
      "name": "Big Game Hunter",
      "description": "Increase maximum Scrap by 2. Basic Attacks against enemy Heroes, Mercenaries, or Monsters accelerates Reduce, Reuse, Recycle Scrap regeneration by 1.5 seconds.",
      "passives": [
        "Destroying a turret with Reduce, Reuse, Recycle gives Gazlowe 15% movespeed for 2 seconds"
      ],
      "image": "storm_ui_icon_gazlowe_salvager.png",
      "talentChanged": true
    },
    {
      "name": "MOLL-E Blingtron 5000 Gift(Active)",
      "description": "Activate to put a Mailbox that will give a random item after 30 seconds the items disappears after 60 if not picked and after 2 minutes if not used. Any hero can get the items:",
      "cooldown": 20,
      "image": "talent1.png",
      "talentChanged": true
    }
  ],
  "4": [
    {
      "name": "Mekgineer's Mount 5000",
      "description": "Activate to make Gazlowe becomes unstopabble for 5 seconds and can't be unmounted by damage while mounted and increases his mount speed to 150%, loses the effect if Gazlowe dismounts",
      "passives": [
        "Gazlowe mount let another mount together on a mining cart installed by Gazlowe, the allied hero will mount instantly to the gazlowe cart without reseting his own mount cooldown"
      ],
      "cooldown": 30,
      "image": "talent1.png",
      "talentChanged": true
    },
    {
      "name": "Hyperfocus Coils",
      "description": "Heroes hit with Deth Lazor are affected by zapped for 3 seconds dealing 40 damage per second to enemy heros close to them. Hitting the same enemy hero with Deth Lazor and Xplodium Charge within 3 seconds on a enemy hero makes Gazlowe zaps all his Rock-It! Turret to deal damage to the enemies. Gazlowe is healed 100% of all zapped damage",
      "image": "storm_ui_icon_gazlowe_combo_w_e.png",
      "talentChanged": true
    },
    {
      "name": "EZ-PZ Dimensional Ripper",
      "description": "Destroying a turret with Reduce, Reuse, Recycle reduces enemy heroes nearby that turret damage by 20% and increase allied heros armor by 10 for 4 seconds, Gazlowe will receive a shield that absorbs 100 damage for each hero affected for 2.5 seconds",
      "image": "storm_ui_icon_talent_imposingpresence.png",
      "talentChanged": true
    }
  ],
  "7": [
    {
      "name": "Goblin Fusion",
      "description": "Generate 3 Scrap for each Hero hit by Deth Lazor.",
      "image": "storm_ui_icon_gazlowe_combo_q_w.png"
    },
    {
      "name": "Cardboard Assassin(active)",
      "description": "Activate to place a Cardboard Assassin decoy unit that have 1000 health and act as a heroic unit for 10 seconds. If you hit Cardboard Assassin with Deth Lazor it becomes zapped and deals enemy heros 40 damage per second and taunts enemy heros for 0.5 second, after 3 seconds it explodes.",
      "cooldown": 10,
      "passives": [
        "Deth Lazor cooldown is reduced by 2 seconds"
      ],
      "image": "talent1.png",
      "talentChanged": true
    },
    {
      "name": "Master Blaster",
      "description": "Deth Lazor and Xplodium Charge Slow enemies hit by 35% for 3 seconds. Rock-It! Turret Basic Attacks against enemies Slowed in this way extend the Slow duration by 0.5 seconds.",
      "image": "storm_ui_icon_gazlowe_combo_w_e.png"
    }
  ],
  "10": [
    {
      "name": "Robo-Goblin",
      "description": "Basic Attacks deal 90 (+4% per level) bonus damage over 5 seconds, stacking up to 3 times.",
      "passives": [
        "Basic Attacks deal 90 (+4% per level) bonus damage over 5 seconds, stacking up to 3 times.",
        "Rock-It! Turrets now explode dealing 135 damage to enemies when they are destroyed",
        "Increase max scrap limit by 6 and increase scrap regeneration speed by 50%"
      ],
      "cooldown": 40,
      "image": "storm_ui_icon_gazlowe_robogoblin.png",
      "talentChanged": true
    },
    {
      "name": "Grav-O-Bomb 3000",
      "description": "After a 1.5 second delay, pull enemies toward the center of an area and deal 220 (+4% per level) damage. Basic Abilities deal 30% more damage for 5 seconds after casting Grav-O-Bomb 3000.",
      "cooldown": 60,
      "image": "storm_ui_icon_gazlowe_gravobomb.png"
    }
  ],
  "13": [
    {
      "name": "Positive Reinforcement",
      "description": "Primary Rock-It! Turret attacks against Heroes increase Gazlowe's Attack Speed by 40% for 3 seconds.Dealing Basic Attack adamage extends the duration of Rock-it! Turrets by 0.75 seconds.",
      "image": "storm_ui_icon_gazlowe_rockitturret.png",
      "talentChanged": true
    },
    {
      "name": "Superior Schematics",
      "description": "Rock-It! Turrets attack up to 2 additional enemies for 60% damage and have 30% increased Basic Attack range.",
      "image": "storm_ui_icon_gazlowe_rockitturret_var1.png"
    },
    {
      "name": "Overload",
      "description": "Deth Lazor can now be recast during its channeling up to three times, each recast will increase the channel time in 0.65 the area in 100% of it's base area and the damage by 75% of the base damage",
      "image": "storm_ui_icon_gazlowe_dethlazor_a.png",
      "talentChanged": true
    }
  ],
  "16": [
    {
      "name": "Firin' Mah Lazorz",
      "description": "L-A-Z-O-R: The next time you cast a Deth Lazor will make all your Rock-it! Turrets shoot a lazor",
      "passives": [
        "Rock-It! Turrets every 5 seconds will charge a lazor making it next shoot deal 125 damage"
      ],
      "cooldown": 30,
      "image": "storm_ui_icon_gazlowe_dethlazor.png",
      "talentChanged": true
    },
    {
      "name": "Ark Reaktor",
      "description": "Reduce the cooldown of Xplodium Charge by 2 seconds. Casting Xplodium Charge creates 3 miniature Rock-It! Turrets that last for 3 seconds. These Turrets do not drop Scrap or benefit from other Talents.",
      "image": "storm_ui_icon_gazlowe_explodiumcharge.png"
    },
    {
      "name": "Overklock",
      "description": "Basic Attacks grant Gazlowe 15% Movement Speed for 2 seconds. Dealing Basic Attack damage to Heroes causes them to take an additional 2.5% of their maximum Health as damage.",
      "image": "storm_ui_icon_talent_autoattack_searing.png"
    }
  ],
  "20": [
    {
      "name": "Mecha-Lord",
      "description": "Deplay a homing missile to seek the targeted enemy unit. The missile gains speed over time, dealing 300 damage and stunning for 1.5 second when it impacts the target. Enemy units can destroy the missile before it reaches its target.",
      "passives": [
        "Basic Attacks increase Gazlowe's Armor by 10 for 10 seconds, up to a maximum of 30."
      ],
      "cooldown": 60,
      "image": "storm_ui_icon_gazlowe_robogoblin.png",
      "talentChanged": true
    },
    {
      "name": "Miniature Black Hole",
      "description": "Increase Grav-O-Bomb 3000's radius by 25% and its damage by 50%. Each enemy Hero pulled reduces its cooldown by 12 seconds.",
      "image": "storm_ui_icon_gazlowe_gravobomb.png"
    },
    {
      "name": "It's Raining Scrap",
      "description": "Reduce the Scrap cost of Rock-It! Turrets by 1. Regain 2 Scrap for each Scrap pickup",
      "image": "storm_ui_icon_gazlowe_rockitturret.png"
    },
    {
      "name": "Bomb Toss",
      "description": "Xplodium Charge gains a 2nd charge with a 3 second cooldown between uses and launches 2 more bombs when it detonates.",
      "image": "storm_ui_icon_gazlowe_explodiumcharge.png"
    }
  ]
}