{
  "abilities": {
    "basic": [
      {
        "name": "Snow Blind (Q)",
        "description": "Throw a snowball that hits all enemies in an area. Enemies hit take 70 damage, are Slowed by 35%, and are Blinded for 1.75 seconds.",
        "image": "mei_q_snowblind.png",
        "abilityChanged": false,
        "manaCost": "35 Mana",
        "cooldown": "10s"
      },
      {
        "name": "Blizzard (W)",
        "description": "Command Snowball to create a Blizzard at the target location for 2 seconds. Enemies within the blizzard take 13 damage every 0.25 seconds and are Slowed by 7%, stacking up to 35%. When the Blizzard ends, enemies within its area take an additional 75 damage and are Stunned for 1.25 seconds.",
        "image": "mei_w_blizzard.png",
        "abilityChanged": false,
        "manaCost": "70 Mana",
        "cooldown": "14s"
      },
      {
        "name": "Icing (E)",
        "description": "Slide quickly in the targeted direction. When this effect ends, enemies near Mei are knocked back, take 52 damage, and are Slowed by 80%, rapidly decaying over 1.5 seconds.Can be canceled during sliding.",
        "image": "mei_e1_slide.png",
        "abilityChanged": false,
        "manaCost": "70 Mana",
        "cooldown": "14s"
      }
    ],
    "heroic": [
      {
        "name": "Avalanche (R)",
        "description": "After 0.5 seconds, roll a massive snowball that consumes enemy Heroes in its path. At the end of its path, the snowball crumbles, releasing the consumed Heroes, dealing 220 damage and Stunning them for 0.5 seconds per Hero consumed.",
        "image": "mei_r1_avalanche.png",
        "abilityChanged": false,
        "manaCost": "80 Mana",
        "cooldown": "90s"
      },
      {
        "name": "Ice Wall (R)",
        "description": "Vector TargetingAfter a 0.75 second delay, create an impassable wall that traps enemy Heroes hit for 2.5 seconds. When the wall expires, trapped Heroes are Slowed by 75%, decaying over 3 seconds.",
        "image": "mei_r2_icewall.png",
        "abilityChanged": false,
        "manaCost": "50 Mana",
        "cooldown": "60s"
      }
    ],
    "trait": {
      "name": "Cryo-Freeze (T)",
      "description": "Become encased in ice for 3 seconds, gaining a rapidly decaying Shield that absorbs up to 1104 damage. While active, this Shield grants Unstoppable and restores up to 35% of Mei's maximum Health.",
      "image": "mei_trait.png",
      "abilityChanged": false,
      "cooldown": "40s"
    }
  },
  "1": [
    {
      "name": "Heavy Pack",
      "description": "Increases the duration of Snow Blind's Slow by 1.5 seconds. Each time Blizzard damages an enemy Hero, reduce the cooldown of Snow Blind by 0.5 seconds and gain 3 Mana.",
      "image": "mei_q_snowblind.png",
      "talentChanged": false
    },
    {
      "name": "Ice Storm",
      "description": "Every 3rd hit of Blizzard against enemy Heroes deals an additional 42 damage. Blizzard's final Stun damage is increased by 150% against all enemies.",
      "image": "mei_w_blizzard.png",
      "talentChanged": false
    },
    {
      "name": "Heat Transfer",
      "description": "Basic Attacks against Stunned, Rooted, or Slowed Heroes deal 33% more damage. Each time Mei Stuns or Slows an enemy Hero she heals for 16 Health.",
      "image": "talent_autoattack_damage.png",
      "talentChanged": false
    }
  ],
  "4": [
    {
      "name": "Slushball",
      "description": "Snow Blind deals 75% increased damage and Structures hit are disabled for 3 seconds.",
      "image": "mei_q_snowblind.png",
      "talentChanged": false
    },
    {
      "name": "Cold Front",
      "description": "Reduce the cooldown of Icing by 3 seconds.  If Mei enters her own Blizzard while Icing is active, the cooldown of Icing is reduced by 5 seconds and she gains 80 Mana.",
      "image": "mei_e1_slide.png",
      "talentChanged": false
    },
    {
      "name": "Crystallize",
      "description": "Reduce the cooldown of Cryo-Freeze by 10 seconds. Mei gains 40 Spell Armor while Cryo-Freeze is active and for 1 second after.",
      "image": "mei_trait.png",
      "talentChanged": false
    }
  ],
  "7": [
    {
      "name": "Induce Hibernation",
      "description": "Blizzard reduces the damage dealt by enemy Heroes inside of its area by 40%. When Blizzard ends, enemy Heroes still within its area gain this effect for an additional 4 seconds.",
      "image": "mei_w_blizzard.png",
      "talentChanged": false
    },
    {
      "name": "Skating Away",
      "description": "When Icing ends, Mei and all nearby allied Heroes gain 20% Movement Speed and 50 Physical Armor for 3 seconds.",
      "image": "mei_e1_slide.png",
      "talentChanged": false
    },
    {
      "name": "Backup Battery",
      "description": "Activate to remove all Roots and Slows and regenerate 20% of maximum Health over 2 seconds. The cooldown of this ability is reduced by 10 seconds each time Mei picks up a Regeneration Globe.",
      "image": "mei_battery.png",
      "talentChanged": false,
      "cooldown": "70s"
    }
  ],
  "10": [
    {
      "name": "Avalanche",
      "description": "After 0.5 seconds, roll a massive snowball that consumes enemy Heroes in its path. At the end of its path, the snowball crumbles, releasing the consumed Heroes, dealing 220 damage and Stunning them for 0.5 seconds per Hero consumed.",
      "image": "mei_r1_avalanche.png",
      "talentChanged": false,
      "manaCost": "80 Mana",
      "cooldown": "90s"
    },
    {
      "name": "Ice Wall",
      "description": "Vector TargetingAfter a 0.75 second delay, create an impassable wall that traps enemy Heroes hit for 2.5 seconds. When the wall expires, trapped Heroes are Slowed by 75%, decaying over 3 seconds.",
      "image": "mei_r2_icewall.png",
      "talentChanged": false,
      "manaCost": "50 Mana",
      "cooldown": "60s"
    }
  ],
  "13": [
    {
      "name": "Flurry",
      "description": "While in her own Blizzard, Mei gains 50% increased Attack Speed and Blizzard's cooldown refreshes 125% faster. If Mei is in her own Blizzard when it ends, gain these bonuses for 3 additional seconds.",
      "image": "mei_w_blizzard.png",
      "talentChanged": false
    },
    {
      "name": "Cooling Servos",
      "description": "While Cryo-Freeze is active, Mei's Basic Ability cooldowns recover 200% faster.Passive: Basic Attacks Slow by 20% for 1.5 seconds.",
      "image": "mei_trait.png",
      "talentChanged": false
    },
    {
      "name": "Polar Vortex",
      "description": "Using an ability causes Mei to deal 24 damage a second to nearby enemies for 4 seconds. Enemy Heroes damaged by this effect also have their Movement Speed and Attack Speed Slowed by 20%.",
      "image": "arthas_frosentempest.png",
      "talentChanged": false
    }
  ],
  "16": [
    {
      "name": "Fresh Powder",
      "description": "Snow Blind gains an additional charge and its range is increased by 33%.",
      "image": "mei_q_snowblind.png",
      "talentChanged": false
    },
    {
      "name": "Black Ice",
      "description": "Icing's Slow effect no longer decays over its duration. Icing deals 300% more damage to enemies very close to Mei.",
      "image": "mei_e1_slide.png",
      "talentChanged": false
    },
    {
      "name": "Acclimation",
      "description": "Each time Mei Stuns or Slows an enemy Hero, the damage she deals and healing she receives is increased by 1%, stacking up to 20 times. While at maximum stacks, Mei also gains 10 Armor. Lasts 8 seconds.",
      "image": "jaina_frostarmor.png",
      "talentChanged": false
    }
  ],
  "20": [
    {
      "name": "Cascade",
      "description": "While traveling, Avalanche constantly launches a volley of untalented Snow Blind snowballs ahead of itself.Passive: Reduce the cooldown of Avalanche by 30 seconds.",
      "image": "mei_r1_avalanche.png",
      "talentChanged": false
    },
    {
      "name": "Shatter",
      "description": "When Ice Wall expires, trapped enemy Heroes hit take 210 damage and have their Armor reduced by 25 for 5 seconds.",
      "image": "mei_r2_icewall.png",
      "talentChanged": false
    },
    {
      "name": "The Big One",
      "description": "Every 15 seconds, the next Snow Blind you cast has 67% increased area and 200% increased damage.",
      "image": "mei_q_snowblind.png",
      "talentChanged": false
    },
    {
      "name": "Flash Freeze",
      "description": "When Mei takes fatal damage she instantly gains Cryo-Freeze. This effect has a 180 second cooldown.",
      "image": "mei_trait.png",
      "talentChanged": false
    }
  ]
}
