{
  "abilities": {
    "basic": [
      {
        "name": "Skull Missile (Q)",
        "description": "Conjure a skull that travels in the target direction after 0.625 seconds, dealing 127 damage to enemies hit and Slowing Heroes hit by 25% for 2 seconds.",
        "image": "mephisto_skull_missile.png",
        "abilityChanged": false,
        "manaCost": "20 Mana",
        "cooldown": "8s"
      },
      {
        "name": "Lightning Nova (W)",
        "description": "A ring of lightning appears around Mephisto for 2.5 seconds. Enemies within the ring take 43 damage every 0.25 seconds.Each time a cast of Lightning Nova hits a Hero, its damage is increased by 3%, up to 30%.",
        "image": "mephisto_lightning_nova.png",
        "abilityChanged": false,
        "manaCost": "50 Mana",
        "cooldown": "14s"
      },
      {
        "name": "Shade of Mephisto (E)",
        "description": "Teleport to a location, dealing 78 damage to nearby enemies and leaving behind a Shade of Mephisto at Mephisto's original location. After 2.5 seconds, Mephisto is teleported back to the Shade's location.",
        "image": "mephisto_shade_of_mephisto.png",
        "abilityChanged": false,
        "manaCost": "35 Mana",
        "cooldown": "18s"
      }
    ],
    "heroic": [
      {
        "name": "Consume Souls (R)",
        "description": "Channel for 2.5 seconds, revealing all enemy Heroes. After the Channel completes, all enemy Heroes take 357 damage and are Slowed by 25% for 2.5 seconds.",
        "image": "mephisto_consume_souls.png",
        "abilityChanged": false,
        "manaCost": "80 Mana",
        "cooldown": "120s"
      },
      {
        "name": "Durance of Hate (R)",
        "description": "After 1 second, unleash a wave of evil spirits that Root the first enemy Hero hit for 2.5 seconds and deal 250 damage to them over the same duration.Durance of Hate spreads outwards from its initial target, Rooting and damaging additional nearby enemy Heroes.",
        "image": "mephisto_durance_of_hate.png",
        "abilityChanged": false,
        "manaCost": "50 Mana",
        "cooldown": "50s"
      }
    ],
    "trait": {
      "name": "Lord Of Hatred (T)",
      "description": " Hitting enemy Heroes with Basic Abilities reduces Mephisto's Basic Ability cooldowns.Skull Missile and Shade of Mephisto grant 1.5 seconds of cooldown reduction per Hero hit, and Lightning Nova grants 0.3 seconds per Hero hit.",
      "image": "mephisto_lord_of_hatred.png",
      "abilityChanged": false
    }
  },
  "1": [
    {
      "name": "Unyielding Power",
      "description": "Quest: Hit Heroes with Skull Missile.Reward: After hitting 20 Heroes, increase Skull Missile's damage by 100.Reward: After hitting 40 Heroes, Skull Missile gains an additional charge.",
      "image": "mephisto_skull.png",
      "talentChanged": false
    },
    {
      "name": "Furious Spark",
      "description": "Every 3rd hit from Lightning Nova against the same target deals 65 bonus damage and grants Mephisto 2 Mana.",
      "image": "mephisto_lightning.png",
      "talentChanged": false
    },
    {
      "name": "Malicious Intent",
      "description": "Shade of Mephisto grants 25% Spell Power while active and for 2.5 seconds after ending.If Mephisto hits enemy Heroes at least 18 times with his Basic Abilities while Shade of Mephisto is active, then increase the duration of the Spell Power bonus to 10 seconds after it ends.",
      "image": "mephisto_shade.png",
      "talentChanged": false
    }
  ],
  "4": [
    {
      "name": "Hateful Mending",
      "description": "Skull Missile grants 10 Mana and heals Mephisto for 70% of the damage it deals to Heroes.",
      "image": "mephisto_skull.png",
      "talentChanged": false
    },
    {
      "name": "Static Barrier",
      "description": "At the end of its duration, Lightning Nova grants Mephisto a Shield equal to 40% of the damage it dealt to Heroes. Lasts 5 seconds.",
      "image": "mephisto_lightning.png",
      "talentChanged": false
    },
    {
      "name": "Spite",
      "description": "Increase Regeneration Globe healing duration by 150%. Every tick of Regeneration Globe healing activates Lord of Hatred, reducing Basic Ability cooldowns by 1 second.",
      "image": "mephisto_hatred.png",
      "talentChanged": false
    }
  ],
  "7": [
    {
      "name": "Ghastly Armor",
      "description": "Shade of Mephisto grants 25 Armor while active and for 2.5 seconds after it ends.",
      "image": "mephisto_shade.png",
      "talentChanged": false
    },
    {
      "name": "Frost Storm",
      "description": "While Shade of Mephisto is active, enemies who are hit by Lightning Nova are Slowed by 15% for 1 second and the Slow from Skull Missile is increased to 50%.",
      "image": "mephisto_shade_b.png",
      "talentChanged": false
    },
    {
      "name": "Trickery",
      "description": "Shade of Mephisto grants 20% Movement Speed while active and for 2.5 seconds after it ends.If Mephisto hits enemy Heroes at least 18 times with his Basic Abilities while Shade of Mephisto is active, then reset the cooldown of Shade of Mephisto.",
      "image": "mephisto_shade_c.png",
      "talentChanged": false
    }
  ],
  "10": [
    {
      "name": "Consume Souls",
      "description": "Channel for 2.5 seconds, revealing all enemy Heroes. After the Channel completes, all enemy Heroes take 357 damage and are Slowed by 25% for 2.5 seconds.",
      "image": "mephisto_souls.png",
      "talentChanged": false,
      "manaCost": "80 Mana",
      "cooldown": "120s"
    },
    {
      "name": "Durance of Hate",
      "description": "After 1 second, unleash a wave of evil spirits that Root the first enemy Hero hit for 2.5 seconds and deal 250 damage to them over the same duration.Durance of Hate spreads outwards from its initial target, Rooting and damaging additional nearby enemy Heroes.",
      "image": "mephisto_durance.png",
      "talentChanged": false,
      "manaCost": "50 Mana",
      "cooldown": "50s"
    }
  ],
  "13": [
    {
      "name": "Abhorred Skull",
      "description": "Hitting a Hero with Skull Missile grants 25% Spell Power for 6 seconds. Skull Missile deals 40% more damage to Heroes under 50% Health.",
      "image": "mephisto_skull.png",
      "talentChanged": false
    },
    {
      "name": "Hysteria",
      "description": "Lord of Hatred also reduces the cooldown of Mephisto's Heroic Ability.  Mephisto is healed for 15% of his maximum Health and Mana when he casts his Heroic Ability.",
      "image": "mephisto_hatred.png",
      "talentChanged": false
    },
    {
      "name": "Shard of Hate",
      "description": "Basic Attacks hit enemies near the primary target and activate Lord of Hatred against enemy Heroes, reducing Basic Ability cooldowns by 1 second per Hero hit.",
      "image": "mephisto_splash.png",
      "talentChanged": false
    }
  ],
  "16": [
    {
      "name": "Lightning Reaction",
      "description": "Skull Missile explodes on contact with Lightning Nova, dealing 138 damage to nearby enemies.",
      "image": "mephisto_skull.png",
      "talentChanged": false
    },
    {
      "name": "Static Field",
      "description": "When Lightning Nova's damage bonus reaches 30%, enemy Heroes within its radius take damage equal to 10% of their maximum Health.",
      "image": "mephisto_lightning.png",
      "talentChanged": false
    },
    {
      "name": "Animosity",
      "description": "Increase the duration of Lightning Nova by 1 second and the maximum amount of bonus damage it can deal from 30% to 42%.",
      "image": "mephisto_lightning_b.png",
      "talentChanged": false
    }
  ],
  "20": [
    {
      "name": "Consumed by Hatred",
      "description": "Consume Souls deals bonus damage equal to 10% of the target's missing Health. If Consume Souls initial cast kills a Hero it will cast 1 additional time.",
      "image": "mephisto_souls.png",
      "talentChanged": false
    },
    {
      "name": "Unspeakable Horror",
      "description": "Durance of Hate Silences enemies while they are Rooted and for 3 seconds after its Root expires.",
      "image": "mephisto_durance.png",
      "talentChanged": false
    },
    {
      "name": "Mimic",
      "description": "While both Shade of Mephisto and Lightning Nova are active, Lightning Nova also casts from the Shade's location.",
      "image": "mephisto_lightning.png",
      "talentChanged": false
    },
    {
      "name": "Shade Lord",
      "description": "Activate to swap locations with Shade of Mephisto and refresh its duration.Passive: Shade of Mephisto benefits from all of Mephisto's level 7 Talents.",
      "image": "mephisto_shade.png",
      "talentChanged": false,
      "cooldown": "20s"
    }
  ]
}